const firebase = require("firebase-admin");
const axios = require("axios");
const serviceAccount = require("./serviceaccount.json");
firebase.initializeApp({
  credential: firebase.credential.cert(serviceAccount),
  databaseURL:
    "https://lotto-changyed-default-rtdb.asia-southeast1.firebasedatabase.app",
});

const db = firebase.database();
const current = new Date();
const year = current.getFullYear();
const month = `${current.getMonth() + 1}`.padStart(2, "0");
const day = `${current.getDate()}`.padStart(2, "0");
const stringDate = [year, month, day].join("/");

const monthNamesThai = [
  "มกราคม",
  "กุมภาพันธ์",
  "มีนาคม",
  "เมษายน",
  "พฤษภาคม",
  "มิถุนายน",
  "กรกฎาคม",
  "สิงหาคม",
  "กันยายน",
  "ตุลาคม",
  "พฤษจิกายน",
  "ธันวาคม",
];
const dayNames = [
  "วันอาทิตย์ ที่",
  "วันจันทร์ ที่",
  "วันอังคาร ที่",
  "วันพุธ ที่",
  "วันพฤหัสบดี ที่",
  "วันศุกร์ ที่",
  "วันเสาร์ ที่",
];
const dxTh =
  dayNames[current.getDay()] +
  " " +
  current.getDate() +
  monthNamesThai[current.getMonth()] +
  " " +
  current.getFullYear();

const currencyFormatter = new Intl.NumberFormat("th-TH");
const getFormattedCurrency = (amount) => currencyFormatter.format(amount);

const VData = [
  {
    lottotype: "STOCK_FOREIGN_DAX",
    lottoimg: "https://tang.huaynaka.com/img/de.3e726c2b.svg",
    lottoname: "หุ้นเยอรมัน",
    detail_th: ``,
    Template: "18-ผลหวยหุ้น-เยอรมัน.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_DOWJONES",
    lottoimg: "https://tang.huaynaka.com/img/us.ae656592.svg",
    lottoname: "หุ้นดาวโจนส์",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "STOCK_FOREIGN_EGX",
    lottoimg: "https://tang.huaynaka.com/img/eg.6b83ab95.svg",
    lottoname: "หุ้นอียิปต์",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "STOCK_FOREIGN_FTSE",
    lottoimg: "https://tang.huaynaka.com/img/gb.d3ddd602.svg",
    lottoname: "หุ้นอังกฤษ",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "STOCK_FOREIGN_HANGSENG_AFTERNOON",
    lottoimg: "https://tang.huaynaka.com/img/hk.06803e0e.svg",
    lottoname: "หุ้นฮั่งเส็ง บ่าย",
    detail_th: ``,
    Template: "10-ผลหวยหุ้น-ฮั่งเส็ง-บ่าย.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_HANGSENG_MORNING",
    lottoimg: "https://tang.huaynaka.com/img/hk.06803e0e.svg",
    lottoname: "หุ้นฮั่งเส็ง เช้า",
    detail_th: ``,
    Template: "04-ผลหวยหุ้น-ฮั่งเส็ง-เช้า.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_KOSPI",
    lottoimg: "https://tang.huaynaka.com/img/kr.eb55e63b.svg",
    lottoname: "หุ้นเกาหลี",
    detail_th: ``,
    Template: "08-ผลหวยหุ้น-เกาหลี.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_MOEX",
    lottoimg: "https://tang.huaynaka.com/img/ru.0cacf46e.svg",
    lottoname: "หุ้นรัสเซีย",
    detail_th: ``,
    Template: "16-ผลหวยหุ้น-รัฐเซีย.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_NIKKEI_AFTERNOON",
    lottoimg: "https://tang.huaynaka.com/img/jp.99bcc1d7.svg",
    lottoname: "หุ้นนิเคอิ บ่าย",
    detail_th: ``,
    Template: "07-ผลหวยหุ้น-นิเคอิ-บ่าย.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_NIKKEI_MORNING",
    lottoimg: "https://tang.huaynaka.com/img/jp.99bcc1d7.svg",
    lottoname: "หุ้นนิเคอิ เช้า",
    detail_th: ``,
    Template: "02-ผลหวยหุ้น-นิเคอิ-เช้า.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_SENSEX",
    lottoimg: "https://tang.huaynaka.com/img/in.e4ab7bd0.svg",
    lottoname: "หุ้นอินเดีย",
    detail_th: ``,
    Template: "15-ผลหวยหุ้น-อินเดีย.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_STI",
    lottoimg: "https://tang.huaynaka.com/img/sg.199f925b.svg",
    lottoname: "หุ้นสิงคโปร์",
    detail_th: ``,
    Template: "12-ผลหวยหุ้น-สิงคโปร์.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_SZSE_AFTERNOON",
    lottoimg: "https://tang.huaynaka.com/img/cn.02c229de.svg",
    lottoname: "หุ้นจีน บ่าย",
    detail_th: ``,
    Template: "09-ผลหวยหุ้น-จีน-บ่าย.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_SZSE_MORNING",
    lottoimg: "https://tang.huaynaka.com/img/cn.02c229de.svg",
    lottoname: "หุ้นจีน เช้า",
    detail_th: ``,
    Template: "03-ผลหวยหุ้น-จีน-เช้า.jpg"
  },
  {
    lottotype: "STOCK_FOREIGN_TWSE",
    lottoimg: "https://tang.huaynaka.com/img/hk.06803e0e.svg",
    lottoname: "หุ้นไต้หวัน",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "STOCK_THAI_EVENING",
    lottoimg: "https://tang.huaynaka.com/img/th.76fca72f.svg",
    lottoname: "หุ้นไทย เย็น",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "KIWI_05",
    lottoname: "หวยยี่กี 5นาที",
    lottoimg: "https://tang.huaynaka.com/img/type-yk05.918793ad.png",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "KIWI_10",
    lottoname: "หวยยี่กี 10นาที",
    lottoimg: "https://tang.huaynaka.com/img/type-yk10.4f035b4b.png",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "KIWI_15",
    lottoname: "หวยยี่กี 15นาที",
    lottoimg: "https://tang.huaynaka.com/img/type-yk15.e3ba21dd.png",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_HANOI",
    lottoname: "หวยฮานอย",
    lottoimg: "https://i.imgur.com/TX4BD4c.png",
    detail_th: `หวยฮานอย (หวยเวียดนาม) เป็น หวยออนไลน์ ที่คอหวยและคนไทย แทงหวยออนไลน์ ทุกวันและไม่น้อยกว่า หวยรัฐบาลไทย หวยลาว หวยยี่กี ส่วนวิธีการเล่นหวยฮานอยก็ไม่ต่างจากหวยอื่นๆ
            ข้อดีของ หวยฮานอย คือออกผลรางวัลทุกวันเวลา 18.00 น. ทำให้การเล่นสนุกและน่าติดตามอย่างมาก ท่านสามารถเข้าเล่นได้ที่ เว็บนาคราช
            นอกจาก หวยฮานอย แล้วยังมีหวยเวียดนามอื่นๆ หวยฮานอยพิเศษ และ หวยฮานอย VIP อีกด้วย รูปแบบการออกผลรางวัลคล้ายๆกัน
            กติกาหรือวิธีการเล่นหวยฮานอย
            หวยฮานอยสามารถเล่นได้ทุกวันตั้งแต่จันทร์ – อาทิตย์ ตั้งแต่เวลา 18.00-18.30 น. (เวลาไทย) ข้อดีเล่นสนุก รูปแบบการแทงนั้นจะมี  3 ตัวบน 2 ตัวล่าง วิ่งบน-วิ่งล่าง
            กติกาการแทง หวยฮานอย เหมือนกับหวยรัฐบาลไทยมีทั้ง 3 ตัวบน 3 ตัวล่าง 2 ตัวบน 2 ตัวล่าง วิ่งล่าง วิ่งบน 
            ทั้งนี้ หากวันที่ไม่มีการประกาศผลรางวัลหวยฮานอยทาง เว็บหวยนาคราช จะทำการคืนโพยให้กับทุกยูสเซอร์ที่มีการเดิมพันเข้ามา
            สำหรับหวยฮานอยออนไลน์ ผู้เล่นสามารถติดตาม ผลหวย ออกทุกวันเวลา 18.00 – 18.30 น. ตามเวลาในไทย (ยกเว้นมีวันหยุดพิเศษจะไม่มีการออกผลรางวัล)`,
            Template: "05-ผลหวยฮานอย-ฮานอย.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_HANOIVIP",
    lottoname: "หวยฮานอยวีไอพี",
    lottoimg: "https://huaynakaraj.com/wp-content/uploads/2023/04/Hanoy-S.png",
    detail_th: `หวยฮานอย VIP คือ หวยฮานอยอีกหนึ่งประเภทที่หวยนาคราชมีให้เดิมพัน มีการออกผลรางวัลทุกวันเช่นเดียวกับ หวยฮานอย และ หวยฮานอยพิเศษ 
            และเป็นอีกหนึ่งหวยรายวันที่ได้รับความนิยมเป็นอย่างมากจากบรรดานักเสี่ยงโชค หวยประเภทนี้จะทำการออกผลรางวัลทุกวันเช่นเดียวกันกับ หวยฮานอยปกติ หรือ 
            หวยฮานอยพิเศษ แต่ หวยฮานอยVIP นั้นจะออกผลในช่วงค่ำ คือช่วงเวลา 19.30 น.โดยการออกผลจะอ้างอิงการประกาศผลรางวัลจากประเทศเวียดนาม
            กติกาการเล่นหวยฮานอยVIP
            ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
            ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย
            เปิดให้ผู้เล่นสามารถทายผลได้ตั้งแต่ เวลา 01:00 น – 19:00 น. ของทุกวัน
            ออกผลรางวัลในเวลา 19.00 – 19.30 น. ของทุกวัน`,
            Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_HANOIEXTRA",
    lottoname: "หวยฮานอยเอ็กตร้า",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Hanoy-VIP.png",
      detail_th: `หวยฮานอย Gold คือ หวยฮานอย อีกหนึ่งประเภทที่ หวยนาคราช มีให้เดิมพัน โดยไม่ต้องใช้ต้นทุนสูงก็สามารถเล่นได้ ซึ่งมีการออกผลรางวัลทุกวันเช่นเดียวกับ หวยฮานอย หวยฮานอยพิเศษ และหวยฮานอย VIP เพียงแต่คนละเวลาเท่านั้น 
                หวยฮานอย Gold เป็นหวยรายวันอีกหนึ่งประเภทที่่กำลังได้รับความนิยมในเวียดนาม และการเดิมพันไม่ต่างจาก หวยรัฐบาลไทย มากนัก แต่เป็นการเพิ่มตัวเลือกให้ผู้ที่ชื่นชอบการเสี่ยงดวงได้มีโอกาสลุ้นรางวัลเลข 2 ตัวบน-ล่าง และ 3 ตัวบนในช่วงเย็นของทุกวัน โดยการประกาศผลรางวัล จะถูกอ้างอิงจากทางการของประเทศเวียดนาม
                หวยฮานอย Gold  เป็นอีกหนึ่งตัวเลือกที่น่าสนใจและกำลังได้รับความนิยมสูงในช่วงนี้ เว็บนาคราชจัดให้เอาใจคอหวยได้เลือกสรรกันอย่างเต็มที่
                กติกาการเล่นหวยฮานอย Gold
                ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
                ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย
                เปิดให้ผู้เล่นสามารถทายผลได้ตั้งแต่ เวลา 01:00 น – 16:30 น. ของทุกวัน
                ออกผลรางวัลทุกวัน เวลา 16.30 น. – 17.00 น. (ตามเวลาในประเทศไทย)`,
                Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_HOCHIMINH",
    lottoname: "หวยโฮจิมินห์",
    lottoimg: "https://i.imgur.com/TX4BD4c.png",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_HOCHIMINHVIP",
    lottoname: "หวยโฮจิมินห์วีไอพี",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-Hanoy-gold.png",
      detail_th: ``,
      Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_LAOPAKEE",
    lottoname: "หวยลาวปากเซ",
    lottoimg: "https://i.imgur.com/n8GgyKP.png",
    detail_th: ``,
    Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_LAORSP",
    lottoname: "หวยลาวสัมพันธ์",
    lottoimg: "https://i.imgur.com/n8GgyKP.png",
    detail_th: `หวยลาว คือ หวยลาว รูปแบบใหม่อีกหนึ่งประเภท ที่กำลังได้รับความนิยมไม่แพ้หวยลาวทั่วไป 
    เนื่องจากมีความพิเศษและน่าสนใจตรงที่ผู้เล่นสามารถลุ้นรวยกันได้ทุกวัน และมีวิธีการเล่นง่ายไม่ยุ่งยากซับซ้อน 
    กติกาการ หวยลาวสัมพันธ์
    การแทง หวยลาวสัมพันธ์ คล้ายกับหวยลาวอื่นๆ คือมีเลข 3 ตัวตรง, 3 ตัวโต๊ด, 2 ตัวหน้า, 2 ตัวหลัง, วิ่งบน, วิ่งล่าง
    เรียกได้ว่า หวยลาวสัมพันธ์ เป็นอีกหนึ่งตัวเลือกที่บรรดานักเสี่ยงโชคไม่ควรพลาด เพื่อเป็นการเพิ่มโอกาสในการถูกรางวัลและเพิ่มช่องทางรับทรัพย์ให้กับตัวคุณเอง 
    โดยผู้เล่น สามารถรับชมการถ่ายทอดสดการออกผลรางวัลได้ที่ http://laostarplus.com/
    เว็บนาคราช โปร่งใส ไม่มีเลขล็อก พร้อมระบบฝากถอนอัตโนมัติ รองรับการทำการ ฝาก – ถอนทุกธนาคาร เข้าสู่ระบบทำรายการง่ายๆแค่คลิกเดียว มีผู้ดูแลตลอด 24 ชั่วโมง
    ออกผลรางวัลทุกวัน ตั้งแต่เวลา 16.00 น. – 16.30 น. (ตามเวลาไทย) ผู้เล่นสามารถเช็กผลหวยลาว`,
    Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_LAOS",
    lottoname: "หวยลาว",
    lottoimg: "https://i.imgur.com/n8GgyKP.png",
    detail_th: `หวยลาว คือ หวยลาว รูปแบบใหม่อีกหนึ่งประเภท ที่กำลังได้รับความนิยมไม่แพ้หวยลาวทั่วไป 
    เนื่องจากมีความพิเศษและน่าสนใจตรงที่ผู้เล่นสามารถลุ้นรวยกันได้ทุกวัน และมีวิธีการเล่นง่ายไม่ยุ่งยากซับซ้อน 
    กติกาการ แทงหวยลาว
    การแทง หวยลาว คล้ายกับหวยลาวอื่นๆ คือมีเลข 3 ตัวตรง, 3 ตัวโต๊ด, 2 ตัวหน้า, 2 ตัวหลัง, วิ่งบน, วิ่งล่าง
    เรียกได้ว่า หวยลาว เป็นอีกหนึ่งตัวเลือกที่บรรดานักเสี่ยงโชคไม่ควรพลาด เพื่อเป็นการเพิ่มโอกาสในการถูกรางวัลและเพิ่มช่องทางรับทรัพย์ให้กับตัวคุณเอง 
    โดยผู้เล่น สามารถรับชมการถ่ายทอดสดการออกผลรางวัลได้ที่ http://laostarplus.com/
    เว็บนาคราช โปร่งใส ไม่มีเลขล็อก พร้อมระบบฝากถอนอัตโนมัติ รองรับการทำการ ฝาก – ถอนทุกธนาคาร เข้าสู่ระบบทำรายการง่ายๆแค่คลิกเดียว มีผู้ดูแลตลอด 24 ชั่วโมง
    ออกผลรางวัลทุกวัน ตั้งแต่เวลา 16.00 น. – 16.30 น. (ตามเวลาไทย) ผู้เล่นสามารถเช็กผลหวยลาว`,
    Template: "02-ผลหวยลาว-หวยลาว.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOUNITY",
    lottoname: "หวยลาวภาคี",
    lottoimg: "https://i.imgur.com/n8GgyKP.png",
    detail_th: `หวยลาวภาคี คือ หวยลาว รูปแบบใหม่อีกหนึ่งประเภท ที่กำลังได้รับความนิยมไม่แพ้หวยลาวทั่วไป 
            เนื่องจากมีความพิเศษและน่าสนใจตรงที่ผู้เล่นสามารถลุ้นรวยกันได้ทุกวัน และมีวิธีการเล่นง่ายไม่ยุ่งยากซับซ้อน 
            กติกาการ แทงหวยลาวภาคี
            การแทง หวยลาวภาคี คล้ายกับหวยลาวอื่นๆ คือมีเลข 3 ตัวตรง, 3 ตัวโต๊ด, 2 ตัวหน้า, 2 ตัวหลัง, วิ่งบน, วิ่งล่าง
            เรียกได้ว่า หวยลาวภาคี เป็นอีกหนึ่งตัวเลือกที่บรรดานักเสี่ยงโชคไม่ควรพลาด เพื่อเป็นการเพิ่มโอกาสในการถูกรางวัลและเพิ่มช่องทางรับทรัพย์ให้กับตัวคุณเอง 
            โดยผู้เล่น สามารถรับชมการถ่ายทอดสดการออกผลรางวัลได้ที่ http://laostarplus.com/
            เว็บนาคราช โปร่งใส ไม่มีเลขล็อก พร้อมระบบฝากถอนอัตโนมัติ รองรับการทำการ ฝาก – ถอนทุกธนาคาร เข้าสู่ระบบทำรายการง่ายๆแค่คลิกเดียว มีผู้ดูแลตลอด 24 ชั่วโมง
            ออกผลรางวัลทุกวัน ตั้งแต่เวลา 16.00 น. – 16.30 น. (ตามเวลาไทย) ผู้เล่นสามารถเช็กผลหวยลาวภาคี`,
            Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_MALAY",
    lottoname: "หวยมาเลย์",
    lottoimg: "https://i.imgur.com/F7NGm3J.png",
    detail_th: `หวยมาเลย์ หรือ Magnum4D เป็นหวยที่ควบคุมและออกผลรางวัลโดยประเทศมาเลเซีย เป็นหวยที่ออกโดยชอบด้วยกฎหมายของประเทศมาเลเซีย 
            โดยวิธีเล่นก็คล้ายๆ กับหวยไทย แต่จะมีเลขเพียง 4 ตัวเท่านั้น แต่ถ้าใครอยากซื้อเพียงตัวเดียว สองตัว หรือสามตัว ก็สามารถทำได้ โดยมีอัตราจ่ายมากกว่า แถมวิธีแทงก็มีหลากหลายมากกว่า 
            เป็นหวยอีกหนึ่งประเภทที่ได้รับความนิยมเป็นอย่างมากโดยเฉพาะคนไทย วิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย ผู้เล่นสามารถเลือกแทง 2 ตัวบน-ล่าง และ 3 ตัวบน หวยมาเลย์ จะออกทุกวันพุธ, วันเสาร์ และวันอาทิตย์
            กติกาการเล่นหวยมาเลย์
            ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
            ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย 
            ออกผลรางวัลในเวลา 18.00 – 18.40 น. ของทุกวันพุธ, วันเสาร์ และวันอาทิตย์`,
            Template: "14-ผลหวยหุ้น-มาเลย์.jpg"
  },
  {
    lottotype: "LATTE_THAI",
    lottoname: "หวยรัฐบาล",
    lottoimg: "https://i.imgur.com/PSmeCfO.png",
    detail_th: `หวยรัฐบาลไทย หรือ สลากกินแบ่งรัฐบาลไทย ออกผลรางวัลทุกวันที่ 1 และ 16 ของทุกเดือน อาจมีการเปลี่ยนแปลงวันเนื่องจากตรงกับวันหยุด เช่น วันปีใหม่, วันแรงงาน
            หวยรัฐบาลไทย ในระบบ หวยออนไลน์ หรือ หวยใต้ดิน ที่หลายคนรู้จัก ได้รับความนิยมเป็นอย่างมาก จะมีการเล่น หรือ แทงหวย แบบ 3 ตัวบน เลขโต๊ด 3 ตัวล่าง (หน้า หลัง) 
            แยกกัน 2 ตัวบน 2ตัวล่าง และเลขวิ่ง 3ตัวบน อ้างอิงจากเลขท้าย 3 ตัวของรางวัลที่1 คือ 3ตัวโต๊ด 
            เลขสลับที่กันของเลขท้าย3ตัวรางวัลที่1 ส่วน 3 ตัวล่าง อ้างอิงผลตามเลขที่ออก 3 ตัวล่าง (เลขหน้า-เลขหลัง) และ 2 ตัวบนอ้างอิงจากเลขท้าย 2 ตัวรางวัลที่ 1 ส่วน 2ตัวล่างอ้างอิงจากผลรางวัล 2 ตัวล่าง
            ซึ่งทุกๆการ ออก ผลหวย หรือ ผลรางวัลหวยรัฐบาลไทย จะอ้างอิงจากกองสลากกินแบ่งรัฐบาล ณ งวดนั้น ๆ จึงมั่นใจได้ว่า โปร่งใส จริงใจ ทุกผลหวยแน่นอน
            กติกาการเล่น หวยรัฐบาลไทย
            หวยรัฐบาล ออกทุกวันที่ 1 และ 16 ของทุกเดือน ซึ่งการ แทงหวย ที่เว็บ นาคราช นั้นสามารถแทงก่อนหวยออกล่วงหน้า 5 วัน 
            แทงหวย 3 ตัวบน คือการแทงตัวเลข 3 ตัวท้ายของรางวัลที่ 1 ของสลากกินแบ่งรัฐบาลในแต่ละงวด
            แทงหวย 3 ตัวโต๊ด คือการแทงตัวเลข 3 ตัวท้ายของรางวัลที่ 1 แต่สลับตำแหน่งตัวเลขที่แทงได้ ไม่จำเป็นต้องแทงให้ถูกตามตำแหน่งที่ออก
            แทงหวย 2 ตัวบน คือการแทงตัวเลข 2 ตัวท้ายของรางวัลที่ 1 ไม่สลับตำแหน่ง
            แทงหวย 2 ตัวล่าง คือการแทงตัวเลขท้าย 2 ตัวของสลากกินแบ่งรัฐบาล หรือลอตเตอรี่
            แทงหวย 3 ตัวล่าง  คือการแทงตัวเลข 3 ตัวท้ายให้ตรงกับผลลอตเตอรี่ หรือ สลากกินแบ่งรัฐบาล ในออก ผลหวย 3 ตัวท้าย มีอยู่ 2 รางวัล
            แทงหวย 3 ตัวหน้า คือการแทงตัวเลข 3 ตัวหน้าให้ตรงกับผลลอตเตอรี่ มีอยู่ 2 รางวัล
            แทงเลขวิ่งล่าง คือ การแทงตัวเลขตัวใดตัวให้ตรงกับ ผลหวย รางวัลเลขท้าย 2 ตัวของสลากกินแบ่งรัฐบาล
            แทงเลขวิ่งบน คือ แทงเลขตัวใดตัวหนึ่งให้ตรงกับเลข 3 ตัวท้ายของรางวัลที่ 1 ในงวดนั้น
            อัตราการจ่ายหวยรัฐบาลไทยของ เว็บหวยนาคราช
            3 ตัวบน บาทละ   960
            3 ตัวโต๊ด บาทละ 150
            3 ตัวล่าง (หน้า หลัง) บาทละ 480
            2 ตัว บน -ล่าง บาทละ 97
            ออกผลรางวัลวันที่ 1 และวันที่ 16 ของทุกเดือน เริ่มตั้งแต่เวลา 15.00 น. – 16.30 น. (ตามเวลาในประเทศไทย) `,
            Template: "03-ผลหวยไทย-สลากกินแบ่งรัฐบาล.jpg"
  },
  {
    lottotype: "LATTE_THAI_BAAC",
    lottoname: "หวยธกส",
    lottoimg: "https://i.imgur.com/1HqxaYp.png",
    detail_th: `หวย ธ.ก.ส. หรือที่รู้จักกันดีในนาม สลากออมทรัพย์ เป็นหวยของทางธนาคารเพื่อการเกษตร และสหกรณ์การเกษตร ซึ่งสลากออมทรัพย์ ธ.ก.ส. 
            คือการออมเงินในรูปแบบหนึ่ง ซึ่งผู้ลงทุนสลากจะได้รับผลตอบแทนในรูปแบบดอกเบี้ย พร้อมทั้งมีโอกาสได้ลุ้นรางวัลไม่ต่างจากการตรวจสลากกินแบ่ง แต่อาจจะดูเป็นเรื่องยากสำหรับหลายๆท่าน 
            ทางเว็บนาคราชจึงมีการเปิดให้ซื้อหวย ธ.ก.ส. ผ่านทางตัวเว็บของเรา ซึ่งจะมีการออกผลรางวัลทุกวันที่ 16 ของทุกเดือน 
            โดยจะใช้รางวัลที่ 1 ของผลการออกรางวัลสลากออมทรัพย์ ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร มาเป็นที่อ้างอิงในการออกผลรางวัล
            กติกาการเล่นหวย ธ.ก.ส.
            ปิดรับแทง ทุกวันที่ 16 ของเดือน เวลา 09.00 น.                                               
            ออกผลรางวัลในทุกวันที่ 16 ของทุกเดือน ในเวลา 12.00 น.                               
            วิธีการเล่นจะมีให้เลือกแทงหลายแบบ คล้ายคลึงกับหวยใต้ดินไทย โดยจะใช้ผลอ้างอิง จากรางวัลที่ 1 เลขท้าย 7 ตัวของสลากออมทรัพย์ ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร                 
            การันตีการออกผลจากทางการ สามารถติดตามได้ทางเว็บไซต์ทางการที่ใช้ดูผลรางวัล ผลสลากออมทรัพย์ ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร https://www.baac.or.th/salak/content-lotto.php หรือที่ huaynakaraj.com
            ผลหวย หวย ธ.ก.ส. ออกผลรางวัลในทุกวันที่ 16 ของทุกเดือน ในเวลา 12.00 น. (ตามเวลาในประเทศไทย)   `,
            Template: "02-ผลหวยไทย-ธกส.jpg"

  },
  {
    lottotype: "LATTE_THAI_GSB",
    lottoname: "หวยออมสิน",
    lottoimg: "https://i.imgur.com/6LGpZpw.png",
    detail_th: `หวยออมสิน หรือ สลากออมสิน เป็นหวยที่ออกโดยธนาคารออมสินเพื่อเป็นการออกรางวัลของหน่วยลงทุนของธนาคาร 
            โดยจะมีการออกผลรางวัลทุกวันที่ 16 ของทุกเดือน และจะยึดผลการออกรางวัลจากธนาคารออมสินเป็นหลัก
            แต่สำหรับการ แทงหวยออนไลน์ ของ หวยออมสิน จะออกทุกวันที่ 16 ของทุกเดือน เหมือนกับ หวยรัฐบาลไทย
            กติกาการเล่นหวยออมสิน
            – ผู้เล่นสามารถเลือกแทงได้คล้ายกับหวยรัฐบาลไทย นั่นก็คือ 2 ตัวบน – ล่าง, 3 ตัวบน
            – ผู้เล่นสามารถตรวจสอบการออกผลหวยออมสินได้ที่เว็บไซต์ นาคราช
            ออกผลรางวัลหวยออมสิน ในทุก ทุกวันที่ 1 ของเดือน ออกสลากออมสินพิเศษ 5 ปี และวันที่ 16 ของเดือน ออกสลากออมสินพิเศษ 3 ปี เวลา 13.00 – 14.00 น`,
            Template: "01-ผลหวยไทย-ออมสิน.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOEAGLE",
    lottoname: "ลาวอินทรี",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-Insee.png",
      detail_th: `หวยลาวอินทรี (ຫວຍລາວອິນຊີ) คือ หวยลาว อีกรูปแบบหนึ่งผู้เล่นสามารถเดิมพัน หวยลาว หวยออนไลน์ ได้ตั้งแต่ 1 บาทขึ้นไป 
                    สามารถเล่นได้ทุกวันเช่นเดียวกับ หวยลาว Star พลัส แต่หวยลาวอินทรีจะออกผลในช่วงค่ำตามเวลาไทย
                    กติกาการแทงหวยลาวอินทรี
                    หวยลาวอินทรี วิธีแทงหวยออนไลน์ ไม่ยุ่งยากหรือซับซ้อนเลยผู้เล่นสามารถเลือก แทงหวย ได้คือ 2 ตัวบน 2ตัวล่าง และ 3 ตัวบน เช่นเดียวกับ หวยรัฐบาลไทย หรือหวยประเภทอื่นๆ
                    ตัวอย่างผลการออกรางวัลหวยลาวรูปแบบ 3 ตัว คือ 138
                    ผลการออกรางวัลหวยลาว 3 ตัวโต๊ด คือ 138,183,318,314,813,831
                    ผลรางวัลหวยลาว 2 ตัวบน คือ 38
                    ผลรางวัลหวยลาว 2 ตัวล่าง คือ 74
                    รางวัลหวยลาว วิ่งบน คือ 3,8 : วิ่งล่าง คือ 7,4
                    สำหรับท่านใดที่อยาก แทงหวยออนไลน์ เราขอแนะนำ เว็บหวยนาคราช ราคาจ่ายสูงที่ให้มากกว่าใคร การันตีการออกผลรางวัลที่โปร่งใส ตรงไปตรงมา สามารถตรวจสอบผลรางวัลด้วยตัวคุณเองผ่าน huaynakaraj.com
                    ผลหวย หวยลาวอินทรี ออกผลรางวัลทุกวัน เวลา 20.30 น. – 21.00 น. (ตามเวลาไทย)`,
                    Template: "04-ผลหวยลาว-ลาวอินทรี.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOMANOROM",
    lottoname: "ลาวมโนรมย์",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo_manorom.png",
      detail_th: `หวยลาวมโนรมย์ หรือ lao lottery เป็นหนึ่งในหวยยอดนิยมในประเทศไทย เพราะเล่นง่ายและมีความน่าเชื่อถือสูง การเล่นก็เหมือนกับหวยลาวอื่นๆ หวยลาวอินทรี, 
      ลาวโพนทอง, ลาวสุวรรณเขต, หวยลาว Star พลัส, หวยสุวรรณเขต 
      หวยลาวมโนรมย์ เป็น หวยออนไลน์ ท้องถิ่นที่อยู่ภายใต้การดูแลของบริษัทรัฐวิสาหกิจหวยพัฒนาหรือ หวยพัฒนา (ลาว:ຫວຍພັດທະນາ) การออกผลรางวัลขึ้นตรงกับรัฐบาลลาวผ่านกระทรวงการเงิน 
      อันมีหน้าที่ในการออกสลากเพื่อนำรายได้พัฒนาเศรษฐกิจในพื้นที่เขตหลวงพระบาง ประเทศลาว
      กติกาหรือการแทงหวยลาวมโนรมย์
      หวยลาวมโนรมย์ ออกผลเหมือนกับหวยรัฐบาล หวยใต้ดินของไทย มีทั้งแบบ หวยลาว 3ตัวบน, หวยลาว 3 ตัวโต๊ด, 
      หวยลาว 2 ตัวบน, หวยลาว 2 ตัวล่าง, หวยลาววิ่งบน, หวยลาววิ่งล่าง
      ตัวอย่างผลการออกรางวัลหวยลาวรูปแบบ 3 ตัว คือ 138
      ผลการออกรางวัลหวยลาว 3 ตัวโต๊ด คือ 138,183,318,314,813,831
      ผลรางวัลหวยลาว 2 ตัวบน คือ 38
      ผลรางวัลหวยลาว 2 ตัวล่าง คือ 74
      รางวัลหวยลาว วิ่งบน คือ 3,8 : วิ่งล่าง คือ 7,4
      หวยลาวมโนรมย์ ออกผลรางวัลทุกวัน ตั้งแต่เวลา 21.00 น. – 21.30 น. (ตามเวลาไทย) สามารถตรวจสอบการออกผลรางวัล`,
      Template: "05-ผลหวยลาว-ลาวมโนรมย์.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOPHONTHONG",
    lottoname: "ลาวโพนทอง",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-Lao-Ponthong.png",
      detail_th: `หวยลาวโพนทอง (ຫວຍໂພນທອງ) เป็น หวยลาว ที่กำลังได้รับความนิยม เนื่องจากสามารถตอบโจทย์คอหวยที่ชื่นชอบ แทงหวย รายวัน ซึ่งสามารถลุ้นรวยได้ในช่วงค่ำ ด้วยวิธีการเล่นที่ไม่ยุ่งยากและมีความน่าเชื่อถือสูง
      สำหรับ หวยลาวโพนทอง เป็นหวยท้องถิ่นเมืองโพนทอง ซึ่งตั้งอยู่ทางทิศตะวันตกของแขวงจำปาศักดิ์ อยู่ตรงข้ามแนวพรมแดนไทย – ลาว ซึ่งรูปแบบการเล่นมีอัตราชนะเดิมพันที่ค่อนข้างสูง
      กติกา หรือ วิธีการแทง หวยลาวโพนทอง ออนไลน์
      วิธีแทงหรือกติกา หวยลาวโพนทอง ไม่แตกต่างจากหวยลาวอื่นๆคือผู้เล่นสามารถเลือกตามความชอบ เลือกแทงได้แบบหวย 3 ตัว หวย 4 ตัวมีทั้งแบบ 3 ตัวตรง และ 2 ตัวบนล่าง
      ทั้งนี้ ผู้เล่นสามารถรับชมการถ่ายทอดสดการออกผลรางวัลได้ที่ http://phonthonglottery.com/
      สำหรับ เว็บหวยนาคราช เป็นเว็บไซต์หวยที่มีอัตราจ่ายสูงสุด ด้วยระบบที่รวดเร็ว ฝาก-ถอน สะดวก พร้อมรองรับการใช้งานผ่านทุกแพลตฟอร์ม huaynakaraj.com
      ผลหวย หวยลาวโพนทอง ออกผลรางวัลทุกวันเวลา 20.15 น. – 20.45 น. (ตามเวลาในไทย)`,
      Template: "03-ผลหวยลาว-ลาวโพนทอง.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOSAVANNAKHET",
    lottoname: "ลาวสุวรรณเขต",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-suwannakhet.png",
      detail_th: `หวยสุวรรณเขต (ຫວຍລາວ: ສະຫວັນນະເຂດ) เป็น หวยออนไลน์ (สลากออนไลน์) ที่อยู่ภายใต้การควบคุมของบริษัทรัฐวิสาหกิจหวยพัฒนาหรือ หวยพัฒนา (ลาว:ຫວຍພັດທະນາ) 
                    สำหรับ หวยลาวสุวรรณเขต ตั้งชื่อตามนครเอกของแขวงสุวรรณเขต ประเทศลาวหรือที่รู้จักกันในนาม 
                    สะหวันนะเขต อันเป็นอีกหนึ่งแขวงที่เป็นเส้นทางเศรษฐกิจที่สำคัญอีกแห่งของลาว 
                    กติกาหรือวิธีแทงหวยลาวสุวรรณเขต
                    กติกาการ แทงหวยออนไลน์ หรือ หวยลาวสุวรรณเขต เหมือนกับหวยลาวอื่นๆ ไม่ว่าจะเป็น หวยลาวอินทรี, ลาวโพนทอง, ลาวสุวรรณเขต, หวยลาว Star พลัส
                    ผู้เล่นสามารถ แทงหวยลาว ได้ทั้ง หวย 3 ตัว มีทั้งหมด 6 รางวัล ดังนี้ 3 ตัวตรง, 3 ตัวโต๊ด, 2 ตัวหน้า, 2 ตัวหลัง, วิ่งบน, วิ่งล่าง
                    หวย 4 ตัว มีทั้งหมด 6 รางวัล ดังนี้ 4 ตัวตรง, 4 ตัวโต๊ด, 3 ตัวตรง, 3 ตัวโต๊ด, เลข 2 ตัวหน้า,เลข  2 ตัวหลัง
                    สำหรับท่านใดที่หาข้อมูลและอยาก แทงหวยออนไลน์ เราขอแนะนำเว็บหวยที่ดีที่สุดในยุคนี้คือ เว็บหวยนาคราช 
                    เพราะจ่ายราคาดีที่สุด มีความโปร่งใส ไม่มีระบบล็อกเลข พร้อมด้วยเจ้าหน้าที่บริการ 24 ชั่วโมง
                    ผลหวย ลาวสุวรรณเขต ออกผลรางวัลทุกวัน เวลา 22.00 น. – 22.30 น. (ตามเวลาในไทย) โดยผู้เล่น`,
                    Template: "06-ผลหวยลาว-ลาวสุวรรณเขต.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_LAOSTARPLUS",
    lottoname: "ลาวสตาร์พลัส",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-LaoStarplus.png",
    detail_th: `หวยลาว Star พลัส คือ หวยลาว รูปแบบใหม่อีกหนึ่งประเภท ที่กำลังได้รับความนิยมไม่แพ้หวยลาวทั่วไป 
      เนื่องจากมีความพิเศษและน่าสนใจตรงที่ผู้เล่นสามารถลุ้นรวยกันได้ทุกวัน และมีวิธีการเล่นง่ายไม่ยุ่งยากซับซ้อน 
      กติกาการ แทงหวยลาว Star พลัส
      การแทง หวยลาว Star พลัส คล้ายกับหวยลาวอื่นๆ คือมีเลข 3 ตัวตรง, 3 ตัวโต๊ด, 2 ตัวหน้า, 2 ตัวหลัง, วิ่งบน, วิ่งล่าง
      เรียกได้ว่า หวยลาว Star พลัส เป็นอีกหนึ่งตัวเลือกที่บรรดานักเสี่ยงโชคไม่ควรพลาด เพื่อเป็นการเพิ่มโอกาสในการถูกรางวัลและเพิ่มช่องทางรับทรัพย์ให้กับตัวคุณเอง 
      โดยผู้เล่น สามารถรับชมการถ่ายทอดสดการออกผลรางวัลได้ที่ http://laostarplus.com/
      เว็บนาคราช โปร่งใส ไม่มีเลขล็อก พร้อมระบบฝากถอนอัตโนมัติ รองรับการทำการ ฝาก – ถอนทุกธนาคาร เข้าสู่ระบบทำรายการง่ายๆแค่คลิกเดียว มีผู้ดูแลตลอด 24 ชั่วโมง`,
      Template: "01-ผลหวยลาว-ลาวสตาร์พลัส.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_SAIGON",
    lottoname: "ไซง่อนวี",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-SAIGON2.png",
      detail_th: `หวยไซง่อน คือ หวยเวียดนามที่มาใหม่ที่มีถิ่นกำเนิดมาจากเมืองหลวงไซง่อนของทาง เวียดนามใต้ ที่นครโฮจิมินห์หรือเมือง ไซง่อน อันเป็นศูนย์กลางทางเศรษฐกิจของเวียดนามเป็นหวยที่ทาง
                เว็บหวยนาคราช ของเราได้นำเข้ามาให้พี่น้องคอหวยนักเสี่ยงโชคทุกท่านได้แทงกัน เพราะหวยชนิดนี้แทงง่ายเเหละมีโอกาศถูกง่าย และ เว็บหวยนาคราช  ของเราก็มีอัตราการจ่ายสูง  ซึ่งเป็นทางเลือกให้กับคนที่สนใจอยากจะ แทงหวยไซ่ง่อน โดยเฉพาะ
                นายเหงียน ถิ เกวี๊ยตเติม ประธานคณะกรรมการประชาชน จึงได้เสนอก่อตั้ง “หวยไซง่อน” ขึ้นมา เพื่อช่วยฟื้นฟูเศรษฐกิจของประเทศ 
                และเป็นอีกหนึ่งหวยออนไลน์ที่กำลังได้รับความนิยมเป็นอย่างมากในประเทศเวียดนามขณะนี้
                "หวยไซง่อน" ก่อตั้งขึ้นมาตั้งแต่ปี 2564 จนถึงปัจจุบัน เป็นอีกหนึ่งบริการที่นักเสี่ยงโชคต่างให้ความสนใจเพราะถูกง่าย ได้ราคาดี มีวิธีการเล่นที่ไม่ซับซ้อนเพราะเหมือนกันกับหวยไทยที่เราคุ้นเคยกันดี
                "ไซง่อน" เป็นสลากตัวเลข (The Numbers Game) ผลรางวัลส่งตรงจากสาธารณรัฐสังคมนิยมเวียดนาม ที่อยู่ในความครอบครองสิทธิ์ของหน่วยงานรัฐ 
                เช่นเดียวกันกับ หวยฮานอย,หวยฮานอยโกลด์ ,หวยฮานอยพิเศษ และหวยฮานอย VIP
                ทั้งนี้การถ่ายทอดสดการออกผลรางวัลของ "หวยไซง่อน" ในประเทศไทยเป็นการร่วมมือกันระหว่างหน่วยงานรัฐบาลของสาธารณรัฐสังคมนิยมเวียดนามและเว็บไซต์นาคราช 
                เราคือผู้ที่ได้รับสัมปทานการถ่ายทอดสดออกผลรางวัล ไซง่อน หรือ หวยไซง่อน แต่เพียงผู้เดียวในประเทศไทย 
                ไซง่อน หรือ หวยไซง่อน จาก เว็บหวยนาคราช เรากล้าท้าให้ลอง ! กับราคาจ่ายที่สูงกว่าใคร ผลการออกรางวัลมีความโปร่งใสและเที่ยงตรง ไม่มีเลขล็อก 
                กติกาการเล่นหวยไซง่อน ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
                ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย 
                ราคานี้ที่นาคราชเท่านั้น! ออกผลรางวัลทุกวันเริ่มตั้งแต่เวลา 21.30 น. – 22.00 น. (ตามเวลาในประเทศไทย)`,
                Template: "07-ผลหวยฮานอย-ไซง่อน.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_SAIGONVIP",
    lottoname: "ไซง่อนวีVIP",
    lottoimg:
      "https://huaynakaraj.com/wp-content/uploads/2023/04/Logo-SAIGON-VIP.png",
      detail_th: `หวยไซง่อนvip  คือ หวยเวียดนามที่มาใหม่ที่มีถิ่นกำเนิดมาจากเมืองหลวงไซง่อนของทาง เวียดนามใต้
                    เป็นหวยใหม่มาแรงที่มียอดผู้สนใจเป็นจำนวนมากวันนี้เราจึงได้เปิดทำการ แทงหวย ไซง่อนVIP วันนี้ ให้กับคอหวยทุกท่าน 
                    พร้อมบริการจากเว็บแทงหวยของเรานั้นต้องเรียกได้ว่าตอบโจทย์และทันสมัยมากกว่าที่อื่น จะออกผลในทุกๆ วันแต่ในส่วนของหวยไซง่อนจะออกตั้งแต่วันจันทร์จนถึงวันศุกร์ 
                    เว้นวันเสาร์และวันอาทิตย์นั่นเอง และเวลาการออกผลรางวัลก็จะแต่งต่างเช่นกัน โดยเวลาการออกรางวัลของหวยไซง่อนVIP คือเวลา 23:30 น. 
                    ถัดจากการออกรางวัลของหวยฮานอยหรือหวยเวียดนามลำดับสุดท้ายประมาณ 2 ชั่วโมง
                    กติกาการเล่นหวยไซง่อนVIP
                    ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
                    ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย 
                    ราคานี้ที่นาคราชเท่านั้น !
                    ออกผลรางวัลทุกวันเริ่มตั้งแต่เวลา 23.00 น. – 23.30 น. (ตามเวลาในประเทศไทย)`,
                    Template: "08-ผลหวยฮานอย-ไซง่อนวีไอพี.jpg"
  },
  {
    lottotype: "LATTE_FOREIGN_US_MILLENNIUM",
    lottoname: "ยูเอสมิลเลียนส์",
    lottoimg: "https://portal.huaynakaraj.com/img/us.ae656592.svg",
    detail_th: `เว็บหวยนาคราช ขอแนะนำ ยูเอส มิลเลี่ยนส์(US Milionionl)ions) หนึ่งใน หวยหุ้น จากประเทศสหรัฐอเมริกา ที่มีมูลในตลาดหลักทรัพย์กว่า 1.337 พันล้านดอลลาร์ !
                "ผู้เล่น" สามารถสร้างโอกาสเพิ่มกำไรจากการลงทุนของท่านได้ง่าย ๆ จากการ เล่นยูเอส มิลเลี่ยนส์ (US Milionion)lions)
                ยูเอส มิลเลี่ยนส์ (US Milionion)lions) หรือ United State Milionionlions อ้างอิงผลการออกรางวัลจากดัชนีเลขท้ายตอนปิดตลาดหุ้นในประเทศสหรัฐอเมริกา 
                วิธีการเล่นก็มีความคล้ายกันกับหวยใต้ดินของไทย แต่จะมีเพียงรางวัลเลข 3 ตัวบน 2 ตัวบนและ 2 ตัวล่างเท่านั้น
                กติกาการเล่นUS มิลเลเนี่ยนี่ยนส์
                ผู้เล่นสามารถเลือกแทง 2 ตัว บน-ล่าง และ 3 ตัวบน
                ผู้เล่นสามารถเดิมพันตั้งแต่ 1 บาทขึ้นไป ซึ่งวิธีการเดิมพันจะคล้าย ๆ กับ หวยไทย
                ออกผลรางวัลทุกวัน ตั้งแต่เวลา 01.00 น. – 04.00 น. (ตามเวลาในประเทศไทย)`,
                Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_EUROSTAR",
    lottoname: "ยูโรสตาร์",
    lottoimg: "https://portal.huaynakaraj.com/img/eu.ee7f4712.svg",
    detail_th: `มาทำความรู้จักกับ หวยอินเตอร์ กับ ยูโร สตาร์ (Euro Star) หนึ่งในลอตเตอรี่ออนไลน์ยอดนิยมอันดับต้นของโลก
                ยูโร สตาร์ "Euro Star" คือ หวยหุ้นออนไลน์ จากประเทศอังกฤษ เป็นอีกหนึ่งหวยออนไลน์ที่ "ผู้เล่น" 
                มีโอกาสถูกได้ง่ายมากที่สุดจึงเป็นที่นิยมอย่างมากในกลุ่มของนักลงทุนทั้งในประเทศอังกฤษและทั่วทุกมุมโลก
                ออกผลรางวัลทุกวัน ตั้งแต่เวลา 24.00 น. – 01.30 น. (ตามเวลาในประเทศไทย)`,
                Template: ""
  },
  {
    lottotype: "LATTE_FOREIGN_EUROSTARVIP",
    lottoname: "ยูโรสตาร์VIP",
    lottoimg: "https://portal.huaynakaraj.com/img/eu.ee7f4712.svg",
    detail_th: `ยูโร สตาร์ วีไอพี  (Euro Star VIP) เป็นหวยหุ้นที่แยกออกมาจาก ยูโร สตาร์ (Euro Star)  จากเลขท้ายของดัชนีหลักทรัพย์ของประเทศอังกฤษ 
                โดยการออกผลนั้นจะอ้างอิงจากราคาหลักทรัพย์ของตลาดหุ้นซึ่งการออกผลของ 
                ยูโร สตาร์ วีไอพี (Euro Star VIP) ได้อ้างอิงจากราคาหลักทรัพย์ของตลาดหุ้นที่มีการซื้อขายตลอดเวลา จึงมั่นใจได้ว่าไม่มีการล็อคผลรางวัล
                ราคาจ่ายสูงที่สุด ระบบฝาก-ถอนรวดเร็วทันใจ ผลรางวัลโปร่งใส สัญญาณส่งตรงจากประเทศอังกฤษ
                ราคาจ่ายสำหรับ ยูโร สตาร์ วีไอพี  (Euro Star VIP) 
                ออกผลรางวัลทุกวัน ตั้งแต่เวลา 24.00 น. – 02.30 น. (ตามเวลาในประเทศไทย)`,
                Template: ""
            },
];

const convertObjectToArray = (object) => {
  if (object) {
    const betArrays = [];
    const keys = Object.keys(object);
    for (let i = 0; i < keys.length; i++) {
      betArrays.push({ betId: keys[i], ...object[keys[i]] });
    }
    return betArrays;
  }
  return [];
};

//https://results.huaynakaraj.com/latte/current_lattes.json

const LatestHuaynakaraj = db.ref("Latest");

const options = {
  weekday: "long",
  year: "numeric",
  month: "long",
  day: "numeric",
};

let endpoints = [
  //`https://result.huaynakaraj.com/nkr-data/${stringDate}/data.json`,
  "https://results.huaynakaraj.com/latte/current_lattes.json",
  //`https://lotto.api.rayriffy.com/latest`,
];

const handleLotto = async () => {
    try {
      await axios.all(endpoints.map((endpoint) => axios.get(endpoint))).then((resx) => {
          const LottoHuaynakaraj = convertObjectToArray(resx[0]["data"]).map((TLatest) => {const resultsub = VData.filter((sub) => sub.lottotype == TLatest[0]?.sub_type);
               return {
                opening_datetime_th: new Date(TLatest[0]?.opening_datetime).toLocaleString("th-TH",options),
                opening_datetime: ""+TLatest[0]?.opening_datetime,
                cutoff_datetime_th: new Date(TLatest[0]?.cutoff_datetime).toLocaleString("th-TH",options),
                cutoff_datetime: ""+TLatest[0]?.cutoff_datetime,
                latte_status:""+ TLatest[0]?.latte_status,
                sub_type:""+ TLatest[0]?.sub_type,
                display_date: ""+TLatest[0]?.display_date,
                latte_type: ""+TLatest[0]?.latte_type,
                announce_datetime_th: new Date(TLatest[0]?.announce_datetime).toLocaleString("th-TH",options),
                announce_datetime:""+ TLatest[0]?.announce_datetime,
                results: TLatest[0]?.results,
                title_th: ""+resultsub[0]?.lottoname,
                img_fg: ""+ resultsub[0]?.lottoimg,
                detail_th: ""+resultsub[0]?.detail_th,
                template: ""+resultsub[0]?.Template
               };
            }
          );
         // console.log(LottoHuaynakaraj)
          const R_LATTE_FOREIGN = LottoHuaynakaraj.filter( latteType => latteType['latte_type'] == "LATTE_FOREIGN");
          const R_STOCK_FOREIGN = LottoHuaynakaraj.filter( latteType => latteType['latte_type'] == "STOCK_FOREIGN");
          const R_LATTE_THAI = LottoHuaynakaraj.filter( latteType => latteType['latte_type'] == "LATTE_THAI");
          const R_LATTE_FOREIGN_HANOI = LottoHuaynakaraj.filter( latteType => latteType['sub_type'].includes("LATTE_FOREIGN_HANOI"));
          const R_LATTE_FOREIGN_LAO = LottoHuaynakaraj.filter( latteType => latteType['sub_type'].includes("LATTE_FOREIGN_LAO"));
          const R_LATTE_FOREIGN_EURO = LottoHuaynakaraj.filter( latteType => latteType['sub_type'].includes("LATTE_FOREIGN_EURO"));
          const R_LATTE_FOREIGN_SAI = LottoHuaynakaraj.filter( latteType => latteType['sub_type'].includes("LATTE_FOREIGN_SAI"));
          const R_LATTE_FOREIGN_HOCHI = LottoHuaynakaraj.filter( latteType => latteType['sub_type'].includes("LATTE_FOREIGN_HOCHI"));

          const R_STOCK_FOREIGN3RAT_MOEX = LottoHuaynakaraj.filter(latteType => latteType['sub_type'].includes("STOCK_FOREIGN_MOEX"))
          const R_STOCK_FOREIGN3RAT_DAX = LottoHuaynakaraj.filter(latteType => latteType['sub_type'].includes("STOCK_FOREIGN_DAX"))
          const R_STOCK_FOREIGN3RAT_FTSE = LottoHuaynakaraj.filter(latteType => latteType['sub_type'].includes("STOCK_FOREIGN_FTSE"))

          LatestHuaynakaraj.child("R_STOCK_FOREIGN3RAT").set([R_STOCK_FOREIGN3RAT_MOEX,R_STOCK_FOREIGN3RAT_DAX,R_STOCK_FOREIGN3RAT_FTSE])
          
       
         

          LatestHuaynakaraj.child("R_LATTE_FOREIGN").set(R_LATTE_FOREIGN)
          LatestHuaynakaraj.child("R_STOCK_FOREIGN").set(R_STOCK_FOREIGN)
          LatestHuaynakaraj.child("R_LATTE_THAI").set(R_LATTE_THAI)
          LatestHuaynakaraj.child("R_LATTE_FOREIGN_HANOI").set(R_LATTE_FOREIGN_HANOI)
          LatestHuaynakaraj.child("R_LATTE_FOREIGN_LAO").set(R_LATTE_FOREIGN_LAO)
          LatestHuaynakaraj.child("R_LATTE_FOREIGN_EURO").set(R_LATTE_FOREIGN_EURO)
          LatestHuaynakaraj.child("R_LATTE_FOREIGN_SAI").set(R_LATTE_FOREIGN_SAI)
          LatestHuaynakaraj.child("R_LATTE_FOREIGN_HOCHI").set(R_LATTE_FOREIGN_HOCHI)
          

         });
    } catch (error) {
      console.log(error);
    }
  };
  setInterval(function () {
   handleLotto();
   //console.log("บอกรักเธอ ...")
  }, 10000);