 [
        "วันนี้ขออนุญาตถูกหวย เพราะอยากเป็นคนสวยและรวยมาก",
        "พรุ่งนี้แล้วสินะ ที่เราจะได้เป็นเศรษฐีเต็มตัวสะที",
        "เป็นผู้หญิงอย่าหยุดหวย เพราะถ้าอยากสวยต้องรวยก่อน",
        "สำคัญกว่าความฝัน คือการตีหวย",
        "ซื้อหวยไม่ใช่คนติดพนัน แต่เป็นคนมีความฝัน..ว่าสักวันฉันต้องรวย",
        "ถ้าวันนี้ดวงไม่ซวย เราจะถูกหวยไปพร้อมกัน!!",
        "วันนี้ให้เรียกพี่..แต่พรุ่งนี้เตรียมเรียกคุณ",
        "วันนี้หวยออกฉันจะเป็นราชา ไม่กินมาม่าแล้วเด้อ",
        "เรื่องอื่นเน้นประหยัด เรื่องหวยเราจัดเต็ม",
        "โอกาสเป็นของคนที่เตรียมพร้อม งั้นขอซ้อมเป็นเศรษฐีแป๊บ",
        "เหนื่อยกับ wfh แค่ไหน ถ้าเป็นเรื่องหวย มีไฟ เสมอ",
        "เป็นคนทุ่มเทตั้งใจจริง โดยเฉพาะกับเลขวิ่ง บน ล่าง",
        "ถึงโอกาสถูกหวยจะน้อย แต่ก็เต็มร้อยเสมอ",
        "ไม่หวังมากหรอก ขอแค่ให้ออกรางวัลที่ 1 !!",
        "ถึงกีฬาไม่เอาไหน แต่ที่ไม่แพ้ใครคือเลขวิ่ง!",
        "ถึงทำอะไรไม่ค่อยจึ้ง แต่เรื่องเก็งรางวัลที่หนึ่งอ่ะต๊าซ",
        "ไม่อยากเป็​นคนที่ถูกรัก แต่..อยากเป็​น​คนที่ถูกหวย",
        "จำแม่นกว่าวันเกิด คือวันที่ 1 กับ 16 ของทุกเดือน",
        "เป็นคนไม่ทำอะไรเล่นๆ เลยเน้นหวยจัดเต็มเสมอ!",
        "ทำงานต้องมีพักร้อน แต่เรื่องหวยไม่มีพักผ่อนนะพูดเลย",
        "งวดนี้พร้อมรวย..ต้องถูกหวยแน่ ๆ ฉันมั่นใจ",
        "วันนี้วันดี พร้อมเป็นเศรษฐีแล้วจ้าา",
        "เลขท้าย 2 ตัว ไม่สนใจ ฉันต้องได้รางวัลที่ 1",
        "ตีเลขต้องไม่พลาด! เดี่ยวโอกาสจะหลุดลอย",
        "ทำดีมาทั้งปี..ขอเป็นเศรษฐีสักครั้งนะ",
        "วันนี้วันรวย คนถูกหวยต้องเป็นฉันแน่ ๆ ",
        "บอกมาเลยวันนี้จะกินไร เดี๋ยวเสี่ยใหญ่เลี้ยงเอง",
        "ฝันดีหรือฝันร้ายก็ตีเลขได้หมด!!",
        "งวดนี้มาแน่ ๆ แม่มั่นใจ!!",
        "งวดนี้ต้องได้ ฉันจะไม่ยอมถูกหวยกินอีกแล้ววว",
        "Squid Game เค้าว่าน่ากลัว...แต่โดนหวยกินหมดตัว น่ากลัวกว่า!",
        "กันโควิดต้องฉีด mRNA แล้วถ้ากันหวยเทต้องฉีดตัวไหน",
        "งวดนี้มาม่า งวดหน้าชาบู",
        "ชีวิตนี้ยังมีงวดหน้าเสมอ",
        "เอาจริงจริง ตอนเมื่อกี้ก็ดีนะ ตอนที่หวยยังไม่ออกอ่ะ",
        "ถ้าใจเราฟิน จะโดนหวยกินก็ไม่เป็นไร",
        "เงินเดือนเรามีน้อย ขอถูกหวยหน่อยก็ไม่ได้",
        "เก่งคณิตแค่ไหน ก็ยังพลาดให้กับหวย",
        "ถูกหวยคือเรื่องแปลก ถูกแดกสิคือเรื่องปกติ",
        "กี่ครั้งแล้วที่ใจเจ็บ จะเข็ดกับหวยได้หรือยัง",
        "วันนี้หวยแดก งดรับแขกหนึ่งวัน",
        "อาการเบื้องต้นไม่มีไข้ อาการทั่วไปไม่มีเงิน",
        "ถ้าทนหวยกินได้ทุกที ชีวิตนี้ก็ไม่มีอะไรยาก",
        "กี่ครั้งที่โดนกิน ก็ยังฟินที่ได้ลุ้น",
        "เจ็บแล้วจำคือคน เจ็บแล้วทนคือคนบ้าหวย",
        "กำลังใจช่วงโควิด คือการคิดว่างวดหน้าเราจะรวย!",
        "เจ็บกว่าไม่ถูกหวย คือคำว่า รู้งี้",
        "เจอหน้าให้บอกหมวย เจอเลขหวยให้บอกเรา",
        "ปากก็บอกว่าเข็ด แต่พอมีเลขเด็ดก็เอาใหม่",
        "กองสลากไม่เคยออกเลขที่ฉันซื้อเลย เสียใจ",
        "รวยเพราะ 3 ตัวบน ดันมาจนเพราะ 2 ตัวล่าง",
        "กี่งวดแล้วที่หวยแดก เดือนนี้ต้องกินแกลบตามเคย",
        "ถึงงวดนี้ไม่ถูกหวย..เราก็ไม่ท้อ สู้ต่อจ่ะ",
        "ไม่ถูกหวยไม่เป็นไร..งวดต่อไปค่อยว่ากัน",
        "งวดนี้พลาดไป เตรียมหาเลขใหม่แป๊บบบ",
        "กี่งวดก็ไม่เข็ด เพราะเลขเด็ดมีตลอด!!",
        "คนไม่มีความฝันคือคนตาย งวดหน้าเจอกันใหม่นะรางวัลที่หนึ่ง",
        "งวดนี้พลาดไม่เป็นไร งวดต่อไปตามแม่น้ำหนึ่ง!!",
        "คนมีความฝัน สักวันต้องถูกหวย",
        "งวดนี้ไม่ถูกก็ไม่ว่า..ก็กินมาม่าเหมือนเดิม",
        "ไก่งามเพราะขน คนจนเพราะหวย",
        "ตอนเช้า ซื้อแล้วรวย ตอนบ่าย ซวยแล้วลื้อ",
        "มือทำรวย หวยทำจน",
        "เช้าวุ่นวาย บ่ายตื่นเต้น เย็นนั่งเศร้า นี่แหละชีวิตเราชาวหวย",
        "คิดถึงแกจัง...ตังค์ที่ซื้อหวยไปเมื่อเช้าอ่ะ",
        "หวยไม่กลัวบ้างเหรอว่าตัวจะแตก มาแดกกันอยู่ได้",
        "นี้มีเท่าไหร่ใส่ให้สุด แล้วไปหยุดที่ มาม่า",
        "ความรักก็เหมือนซื้อหวย ถ้าถูกก็รวย ถ้าซวยก็ช้ำหนัก",
        "ชีวิตวันนี้มันโหด...เป็นโสดแถมยังไม่มีจะกิน",
        "ตอนเช้าอารมณ์ดี๊ดี พอบ่ายหวยออกทีแทบเขวี้ยงมือถือ",
        "อาการเบื้องต้นไม่มีไข้ อาการทั่วไปไม่มีเงิน",
        "เกิดเป็นคน ต้องดิ้นรนเพื่อค่างวด...งวดนี้ กับงวดหน้า",
        "เห็นงานแล้วป่วย เห็นหวย สู้ตาย!",
        "เรื่อง หวย กับ ผู้ชาย เลิกงมงายกันได้หรือยัง?",
        "เด็ดกว่าเลขหวย ก็ความสวยของคนซื้อนี่ล่ะ!",
        "ซื้อหวยได้ กระดาษ ซื้อสาด ได้นั่งได้นอน",
        "เป็นคนมีโลก 2 ใบ...โลกหนึ่งอยู่ใต้ดิน โลกหนึ่งอยู่รัฐบาล",
        "ดูเหมือนเป็นคนนิ่งๆ แต่นิสัยจริงๆ ซื้อหวยเก่งมาก",
        "เรื่องอื่นเจ็บแล้วพอ แต่เรื่องหวยท้อไม่ได้!",
        "จุดธูปไหว้พระใช้สามดอก จุดธูปลุ้นเลขที่ออกดอกเดียวจบ!",
        "วิชาเลขไม่เคยเข้าใจ วิชาหวยไม่เคยต้องสอน",
        "ไม่เคยหยุดอยู่กับที่...เพราะชีวิตมีงวดถัดไปเสมอ",
        "ถูกหวยทีเหมือนเงินทอน จะให้มูฟออนได้ไง!",
        "หวยออกเป็นเรื่องน่าลุ้น แต่ทุกเรื่องเกี่ยวกับคุณอ่ะน่ารัก",
        "เรื่องหวยไม่ค่อยถนัด แต่เรื่องดูแลคนรักจัดว่าเก่ง สนป่าว",
        "ไม่เบื่อเหรอโดนหวยกิน โดนเรากินก็ฟินนะ",
        "หวยยังเกินราคา เมื่อไหร่เธอจะเห็นค่าเราบ้างนะ",
        "ถ้าหวยทำเธอโมโห มาคิมิโนโต๊ะกับเราก็ได้นะ",
        "เธอจะถูกรางวัลอะไรก็ได้ แต่ถูกใจเราได้คนเดียวนะ",
        "ชอบเลขไหนก็หยิบเอา แต่ถ้าชอบเราก็จีบได้",
        "หวยกินแล้วเพลียใจ แต่เห็นเธอทีไรแล้วร่าเริง",
        "ซื้อหวยเสี่ยงเงินหมด แต่ซื้อใจเรามีแต่เพิ่มไม่มีลดนะขอบอก",
        "ไม่ต้องใช้หรอกแคปชั่นอ่อย ถ้าเราไม่อร่อยหวยคงไม่กิน",
        "ใบ้หวยอาจไม่ถนัด แต่แสดงออกว่า รัก เราเก่งมาก",
        "ถ้าน้องชอบคนรวย รอแป๊บ! ลุ้นหวยก่อน",
        "หวยมีแค่บนกับล่าง ถ้าอยากมีคนข้างๆ บอกเราได้นะ",
        "อยากถูกหวยต้องไหว้ไอ้ไข่ แต่ถ้าอยากได้ใจมาไหว้แม่เราสิ",
        "ไม่ค่อยเก่งเรื่องหวยเรื่องหุ้น...แต่เรื่อง รักคุณ ไม่เคยแพ้ใคร ",
        "อยากถูกหวยเลยทำบุญ แต่อยากได้ใจคุณต้องทำไง",
        "อร่อยไม่อร่อย ก็โดนหวยกินบ่อยๆอ่ะคิดดู!",
        "หวยไม่ถูกไม่เป็นไร ขอแค่เป็นคนที่ถูกใจเธอก็พอ",
        "เล่นหวยต้องอาศัยดวง แต่ถ้าอยากมีคนควงต้องอาศัยเรา",
        "อยากถูกหวยอ่ะต้องลุ้น แต่ถ้าเป็นคุณอ่ะต้องรัก",
        "หวยก็เหมือนความรัก แรกๆก็เข็ด แต่พอมีเลขเด็ดก็ลองใหม่",
        "เล่นหวยมีความเสี่ยง แต่มีเราข้างเคียงอ่ะมีความสุข",
        "อยากถูกหวยเลยทำบุญ แต่ถ้าอยากถูกใจคุณต้องทำไง",
        "อกหักยังไม่หนักเท่าหวยเฉียด",
        "ถูกหวยมันยากนะ ถูกเรารักอ่ะง่ายกว่า",
        "อิจฉาหวยจัง อย่างน้อยก็ได้กินเธอ",
        "หวยทำเราเพ้อ...แต่เธออ่ะทำเรา รัก",
        "ถึงความหวังถูกหวยยังเบลอๆ แค่คำว่ารักเธออ่ะชัดเจน",
        "ซื้อหวยเพราะอยากได้ลุ้น ที่ยิ้มให้คุณเพราะอยากได้ใจ",
        "รู้ว่าเธอเจ็บใจมาจากหวย ฝากเราช่วยดูแลให้มั้ยล่ะ",
        "เจ็บมาทุกงวด แต่ก็ไม่เคยหยุดเล่น จนกว่าฝันจะเป็นจริง!!",
        "งวดนี้ไม่เป็นไร..สู้ต่อไปสิว่ะอีหญิง",
        "เราจะไม่หยุด จนกว่าจะได้รางวัลที่ 1",
        "อะไรก็ฉุดเราจากการซื้อหวยไม่ได้!!",
        "จะไม่ยอมแพ้ แม้ได้แค่เลข 2 ตัวท้าย!!",
        "ใครอยากเป็นเศรษฐี ต้องมีเลขเด็ด!!",
        "เรื่องหวยเราจะไม่พัก เรื่องรักพักก่อนนน",
        "ใครมีเลขเด็ด ขอให้ยกมือขึ้น!!",
        "งวดนี้เฉียดฉิว งวดต่อไปต้องเข้าแล้ววว",
        "นั่งลุ้นหวย ใจต้องสู้นะบอกเลยย",
        "ถึงงวดนี้พลาด..แต่ชีวิตเราต้องหาเลขต่อ",
        "ความฝันของฉันคือ ถูกหวยรางวัลที่ 1",
        "ล้มแล้วสู้ต่อ ไม่ย่อท้อต่อการหาเลขเด็ด",
        "รีบนอนตอนฝันจะได้ตีเลขงาม ๆ ",
        "ชีวิตยังมีเลขใหม่เสมอ",
        "เดือนหนึ่ง สู้ตายอยู่ 2 วัน!! วันที่ 1 กับ 16",
        "ที่ไหนมีเลขเด็ดขอให้บอก สถานที่ไหนก็แค่ปากซอย",
        "จะท้อได้ยังไง ยังไม่ถูกรางวัลที่ 1 เลยยย",
        "กี่งวดก็ไม่เข็ด เพราะเลขเด็ดเราต้องหาต่อ!!",
        "ทำบุญไหว้ทุกศาล ขอดลบรรดาลให้ลูกช้างถูกหวยทีเถอะ",
        "ฉันเป็นคนดี..งวดนี้ต้องถูกหวย!!",
        "ถึงจะถูกหวยกิน แต่ก็ต้องวิ่งหาเลขใหม่!!",
        "กี่งวดก็ไม่ท้อ เพราเราจะไม่หยุดที่เลขท้าย 2 ตัว",
        "งวดนี้ถูกเลขท้าย งวดต่อไปถูกรางวัลที่ 1 มั่นมากกก",
        "ถึงจะถูกหวยกินประจำ แต่ก็ยังไม่เข็ด!!",
        "ไม่อยากเป็นคนที่ถูกรัก แต่อยากเป็นคนที่ถูกหวยยย",
        "งวดนี้ถือว่าเป็นบทเรียน งวดหน้าอย่าให้พลาดเชียวล่ะ",
        "เฉี่ยวไปเฉี่ยวมา งวดหน้าต้องถูกแล้วนะเธอออ",
        "ยังนึกเลขเด็ดไม่ออก ก็ลอกเพื่อน!!",
        "วันนี้หวยออก เตรียมพร้อมรวยยย ",
        "วันนี้วันรวย เพราะคนถูกหวยต้องเป็นฉัน",
        "ฤกษ์ดีวันนี้ 4 โมงเย็น ฉันจะกลายเป็นคนรวย",
        "ไม่มีดวงไม่เป็นไร ขอแค่ 2 ตัวท้ายก็พอ",
        "ทำดีมาทั้งปี ขอเป็นเศรษฐีสักงวดนะ ",
        "ไม่อยากเป็นคนที่ถูกรัก แค่อยากเป็นคนน่ารักที่ถูกหวย",
        "กี่ครั้งที่โดนกิน แต่ใจก็ยังฟินที่ได้ลุ้น",
        "กำลังใจช่วงต้นเดือนและกลางเดือนคือ การคิดว่าพรุ่งนี้จะรวย",
        "ชีวิตนี้ไม่เคยหวังอะไรเกินตัว ขอแค่ให้ถูกรางวัลที่ 1 ก็พอ",
        "เห็นงานแล้วป่วย เห็นหวยสู้ตาย",
        "ถ้าเป็นคนที่เธอไม่ถูกใจ อย่างน้อยขอเป็นคนที่ถูกหวยแล้วกัน",
        "แข่งบุญแข่งวาสนาคงแข่งกับใครไม่ได้ แต่แข่งกันซื้อหวยบอกเลยว่าสู้ตาย ! ",
        "ไม่เคยคบเพื่อนที่ฐานะ แต่จะคบเพื่อนที่มีเลขเด็ดเท่านั้น",
        "ไม่อยากเป็นแล้วคนสวย ขอเป็นคนที่ถูกหวยดีกว่า",
        "ทุกคนมีความฝัน ว่าสักวันต้องถูกหวย",
        "อยากเปย์เธอทุกวัน แต่ขอพรุ่งนี้แล้วกัน เพราะจะถูกหวย",
        "ไม่ค่อยชอบคนดี แต่ชอบคนที่มีเลขเด็ด",
        "ถ้าเธอชอบคนเก่ง เราคิดเลขเก่งเธอชอบไหม",
        "วันครบรอบของเราคือ วันที่ 1 และ 16 เท่านั้น",
        "เงินซื้อทุกอย่างได้ ยกเว้นซื้อรางวัลที่ 1",
        " ซื้อทุกตัวเลย ยกเว้นตัวที่ออก",
        " เป็นผู้หญิงอย่าหยุดหวย เพราะถ้าอยากสวยต้องรวยก่อน",
        " ชอบออกกำลังกายแต่ไม่ผอมสักที เพราะเอาแต่วิ่งเลขบน-ล่าง",
        " ก่อนหวยออกก็ฝันถึงชาบู หมูกระทะ แต่พอหวยออกก็ต้มมาม่ากินเหมือนเดิม",
        " ชีวิตนี้ยังมี “งวดหน้า” เสมอ",
        " หวยเปลี่ยนชีวิต จากเงินที่เหลือน้อยนิด ตอนนี้ไม่เหลือติดตัวเลย",
        " หวยก็เหมือนความรัก ต้องผ่านอะไรแย่ ๆ มาก่อนถึงจะสมหวัง",
        " เลขที่ซื้อไม่ออก เลขที่ออกไม่ซื้อ",
        " “คนเล่นหวย” เป็น “คนจริงใจ” มากนะ เพราะถูกกินกี่งวด ๆ ก็กลับไปซื้อซ้ำตลอดเลย",
        " ถ้าใจเรานิ่ง โดนหวยกินก็ไม่ใช่ปัญหา",
        " ความพยายามอยู่ที่ไหน การถูกเลขที่ใช่ก็ต้องมีสักวัน",
        " หมายเลขที่ท่านเล่นไม่ออกในงวดนี้ กรุณาเล่นใหม่ในงวดต่อไป",
        " งวดนี้คือบทเรียน งวดหน้าคือความหวัง",
        " รางวัลที่ 1 ก็เหมือนเนื้อคู่ รู้ว่ามีแต่ยังหาไม่เจอ",
        " กีฬาเดียวที่ชอบ คือวิ่งไปหาเลขเด็ด",
        " พลาดรถ พลาดรา พลาดได้ แต่พลาดเลขเด็ดไม่ได้ทุกงวด",
        " เจ็บป่วยกินยาก็หาย ถ้ายังไม่ตายขอแค่ถูกหวย",
        " ซื้อหวยทุกงวด เฮ้อ ! ชวดทุกที",
        " หวยก็เหมือนความรัก ถ้าครั้งนี้ไม่ใช่ ครั้งหน้าเอาใหม่",
        " เจ็บแล้วจำคือคน เจ็บแล้วจนคือคนซื้อหวย",
        " ได้แต่ฝันว่า “ถูกหวย” แต่ก็แค่อยากรวยในชีวิตจริง (บ้าง)",
        " เช้าวุ่นวาย บ่ายตื่นเต้น เย็นปลากระป๋อง",
        " ยากกว่าการเป็นคนที่ถูกใจ คือการเป็นคนที่ถูกหวย",
        " รู้อะไรไม่เท่า รู้งี้ซื้อเลขนี้ดีกว่า",
        " โดนหวยกินอย่าใส่ใจ เตรียมรวยเอาไว้ในงวดหน้า",
        " หวยออกเลขที่ฝัน แต่ดันลืมซื้อ",
        "สงสัยเราไม่เหมาะกับการถูกรัก แต่เหมาะกับการถูกหวย (รวยแล้วจ้า)",
        "พอจนก็เรียกเฒ่า พอถูกหวย เอ้า… เรียกป๋าซะงั้น",
        "จนมาหลายงวด ชวดมาหลายครั้ง แต่อยากขออวดสักครั้งว่า งวดนี้ เจ๊รวย !",
        "เพื่อนทักว่าหน้าหมอง พอถูกหวยคูณสอง เพื่อนบอกหน้าใส",
        "ถูกหวยทีเหมือนเงินทอน แล้วจะให้มูฟออนได้ไง",
        "เบื่อจังถูกหวย ขอไปทำหน้าสวย ๆ ก่อนนะคะ",
        "เลิกหวยที่ว่ายาก ยังไม่มากเท่าเลิกรักเธอ",
        "เลขเด็ดงวดนี้ 098-xxx-xxxx อยากเฮงโทรมานะ",
        "ถูกหวยทำไมต้องลุ้น ให้เราเป็นแฟนคุณแทนก็ได้",
        "หวยมีเลขอั้น แต่เรื่องรักเธอเราเต็มที่ทุกวันนะ",
        "หวยงวดนี้เลขอะไรเราไม่รู้ แต่เนื้อคู่เรารู้ว่าเธอชัวร์",
        "เล่นหวยก็เหมือนแอบรักเค้า สักวันเราจะเป็นที่หนึ่งให้ได้",
        "ลุ้นหวยไม่เคยพัก เรื่องรักก็ไม่เคยแผ่ว",
        "ทุกงวดก็บอก รู้งี้ เหมือนโดนเธอเทกี่ทีก็ไม่เข็ด",
        "หวยออกแล้วช้ำใจ อยากได้ไลน์เธอปลอบจัง",
        "ถึงไม่ใช่แม่น้ำหนึ่ง แต่คิดถึงเธอที่หนึ่งเลยนะ",
        "โดนหวยกิน ไม่ฟินเท่าโดนเราหรอก",
        "ถึงจะชอบหวยชอบลุ้น แต่ไม่ชอบล้อเล่นกับใจคุณแน่นอน",
        "ไม่เก่งเรื่องหวยเรื่องหุ้น ขอสวยถูกใจคุณแทนแล้วกัน",
        "โดนหวยกินให้บอกเพื่อน เงินไม่พอสิ้นเดือนให้บอกพี่",
        "เรื่องหวยเราคือเหยื่อ เรื่องรักเราคือเสือนะขอบอก",
        "โดนหวยกินมันปวดใจ กินเรามั้ย...แซ่บนะ",
        "ลุ้นหวยยังมีพัก แต่ลุ้นให้เธอรักเราไม่พักนะ",
        "ถึงไม่น่าลุ้นเท่าหวย แต่เรื่องสวยเราไม่แพ้ใคร",
        "อยากถูกหวยต้องไปไหว้พญานาค แต่ถ้าถูกใจมากมาไหว้พ่อแม่เราสิ",
        "เบื่อแล้วหวยกิน อยากกินเธอบ้างจัง",
        "เลิกเหอะล็อตเตอรี่ มาเป็นคนดีของเราดีกว่า",
        "ที่เห็นเราเงียบไปหลังหวยกินบ่อยๆ...เพราะของอร่อยไม่พูดเยอะ",
        "เลขบน เลขล่าง ลุ้นไม่ได้ว่าง แต่หัวใจฝั่งซ้ายน่ะว่างสำหรับเธอเสมอ",
        "เรื่องหวยไม่พัก เรื่องน่ารักก็ไม่แผ่ว #โสดนะจีบได้",
        "หวยยังมีลดราคา แต่เธออ่ะ น่ารักไม่ลดลงเลยนะ",
        "หวยออกเป็นเรื่องน่าลุ้น แต่ทุกเรื่องเกี่ยวกับคุณอ่ะน่ารัก ",
        "ถ้าหมูกับหวยแพงเกินไป มากินใจเราก็ได้นะ",
        "ไม่เบื่อเหรอโดนหวยกิน โดนเรากินก็ฟินนะ ",
        "ถึงให้หวยเธอไม่ได้ แต่เราเป็น รางวัลที่หนึ่ง ให้เธอได้นะ สัญญา",
        "หวยกินทำหัวร้อน แต่เธออ้อนทำเรารัก",
        "ถึงไม่มีเลขที่เข้าตา แต่รู้ไว้นะว่าเธอยังมีเราที่เข้าใจ",
        "งวดนี้หวยออกอะไร ออกเลข 080XXX-XXXX รึเปล่าน้าาา",
        "เรื่องหวยต้องใช้เดา แต่ถ้าเป็นเรื่องของเราต้องใช้ใจ",
        "รอรางวัลที่ 1 ยังรอได้ รอเธอมีใจเราไหวอยู่แล้ว",
        "ถ้าหวยแพงเกินไป มาซื้อใจเราก็ได้นะ",
        "ซื้อหวยมันคือการลุ้น แต่กับคุณน่ะคือ ความรัก",
        "ไม่ถูกหวยก็ไม่เป็นไร แค่ถูกใจเธอก็เหมือนได้รางวัลที่หนึ่ง",
        "ถึงเรื่องถูกหวยจะไม่เคย แต่เธอถูกใจเราบ่อยเลย รู้ตัวป่าว?",
        "ไม่ค่อยเก่งเรื่องหวยเรื่องหุ้น...แต่เรื่อง รักคุณ ไม่เคยแพ้ใคร",
        "เจ็บแล้วจำคือคน หวยกินแล้วยังทนคือรักแท้",
        "เล่นหวยต้องเสี่ยงดวง แต่ถ้าได้เราไปควงไม่ต้องเสี่ยงอะไรเลย",
        "หวยกับความรักเหมือนกันตรงที่...จะพลาดหวังกี่ทีก็ไม่เข็ด",
        "บ่ายนี้จะถูกหวยซะให้พอ แล้วไปขอเธอแต่งงาน",
        "ไม่ใช่แค่หวยที่เด็ด แต่เราก็เด็ดไม่แพ้กันนะ",
        "เลขเด็ดก็อยากมอง เลขห้องเธอก็อยากได้",
        "เธอก็เหมือนกับหวย ไม่ถูกก็ให้อภัย เพราะใจเรารัก",
        "ไม่ถูกหวยไม่เท่าไหร่ แต่คนที่ใช่แบบเธอ เท่าไหร่เท่ากัน",
        "ถ้าเธอเศร้าเพราะหวย ให้เราช่วยดูแลใจมั้ย",
        "เรื่องเก็งเลขเด็ดไม่ค่อยเจ๋ง เพราะเรื่องที่เก่งคือรักเธอ",
        "ถึงหวยจะใช้คำว่าเล่น แต่ถ้าเป็นเธอเราใช้คำว่ารัก",
        "แม้รางวัลที่หนึ่งยังห่างไกล แต่ดีใจที่มีเธอใกล้ๆ กัน",
        "สลากยังกินแบ่งรัฐบาล ชอบเธอมาตั้งนาน แบ่งใจให้เราบ้างสิ",
        "ลุ้นกว่าลอตเตอรี่ ก็ตอนที่อยากมีเธอเป็นแฟน",
        "อยากเกิดเป็นหวยดูซักตั้ง จะได้กินเธอซักครั้งก็ยังดี",
        "กลุ้มใจจัง หวยก็ชอบอั้น เธอก็ไม่รักกันซะที",
        "ไม่ถูกหวยอย่ามัวเศร้า มาถูกเนื้อต้องตัวเราแทนก็ได้",
        "ไม่ถูกหวยอดกินของอร่อย แต่ถ้ามีใจให้เราหน่อยจะได้กินของอร่อยทุกวัน",
        "ส่องเลขบ่อยเพราะอยากเฮง แต่ที่ส่องเธอเก่งเพราะอยากได้ใจ",
        "เห็นหวยแล้วมีลุ้น เห็นคุณแล้วมีกำลังใจ",
        "ถ้าเลขเด็ดยังไม่มี มากดฟอลไอจีเรามั้ยล่ะ",
        "เบื่อเล่นหวยแล้วต้องเสี่ยง อยากมีเธอข้างเคียงแล้วไม่โสด",
        "ระหว่างหวยกับโควิด เราเสี่ยงติดเธอมากกว่า #คิดถึงนะ",
        "ถึงจะเดาเลขผิดไป แต่ คนที่ใช่ แน่ใจว่าเป็นเธอ",
        "อยากเศร้าต้องโดนหวยกิน อยากฟินต้องมาหาเรา",
        "ถ้าหวยออนไลน์ไม่ถูก หวยลาวไม่ไหว มาเล่นเราบ้างก็ได้ถูกใจแน่นอน",
        "ซื้อหวยเพราะอยากได้ลุ้น ที่ยิ้มให้คุณเพราะอยากได้ใจ ",
        "ไม่มีเงินซื้อหวยไม่ได้ แต่ถ้าอยากมีใจเราให้ฟรี",
        "รู้ว่าเธอเจ็บใจมาจากหวย ฝากเราช่วยดูแลให้มั้ยล่ะ",
        "ถ้าเป็นคนถูกหวยมันยากนัก ขอเป็นคนที่ถูกรักจะได้มั้ย",
        "ใครๆก็ชอบคนรวย เดี๋ยวพรุ่งนี้หวยออกเราจะรวย ชอบเราได้ยัง",
        "ถ้าหวยออนไลน์ไม่ถูก หวยลาวไม่ไหว มาเล่นเราบ้างก็ได้ถูกใจแน่นอน",
        "สยองยิ่งกว่าผีหลอก ก็ตอนหวยออกเนี่ยแหล่ะค่าา",
        "เลขมงคลเลขไหน ก็ไม่เสริมกำลังใจเท่า 1 กับ 16",
        "เป็นคนถูกรักว่ายากแล้ว เป็นคนถูกหวยยากกว่าอีก",
        "ติดโควิดยังหายได้ แต่ติดหวยเข้าไปคือตลอดชีวิต",
        "ทำดีต้องได้ดี ซื้อหวยขนาดนี้ต้องมีถูกสักงวดแหละ",
        "แค่แม่ค้าหวยทัก เราก็พร้อมควักตังค์ให้แล้ว",
        "ถูกหวยคงชาติหน้า ทำหน้าดีกว่าสวยชาตินี้",
        "กัญชายังมีปลดล็อค แล้วเมื่อไหร่จะปลดล็อครางวัลที่ 1 ให้มั่ง",
        "มีแค่สองวันที่คนเราท้อได้แต่ไม่ล้มเลิก...คือวันที่ 1 และ 16",
        "ยามเศรษฐกิจซบเซา ก็หวยนี่แหละที่เคียงข้างเราเสมอ",
        "รายได้ไม่ค่อยมี แต่ซื้อหวยทีนัมเบอร์วัน ",
        "อย่าหมิ่นเงินน้อย อย่าคอยวาสนา ใบละ 80 บาทอาจกลายเป็น 6 ล้าน!!!",
        "เหนื่อยจากงานทีไร ก็มีหวยแหละที่เยียวยาใจเราได้",
        "รักแท้กับหวยเหมือนกันตรงที่ จะผ่านไปกี่ปีก็เลิกไม่ได้!",
        "เรื่องอื่นไม่สู้คน แต่ซื้อหวยบอกลาความจนคือสู้ตาย!",
        "ซื้อตั้งแต่หวยแพงยัน 80 บาท ขอถูกหวยชาตินี้ซักงวดนะ",
        "ถึงขับรถไม่ซิ่ง แต่เรื่องเลขวิ่งพี่ซิ่งไม่แพ้ใคร",
        "เค้าบอกวันนี้จะเป็นเศรษฐี แต่ไม่รู้ว่า...ชาตินี้ หรือ ชาติหน้า",
        "ถึงไม่ใช่คนถูกหวย แต่เรื่องสวยเรามั่นใจ!",
        "เป็นลูกครึ่งค่ะ ครึ่งวันลุ้น ครึ่งวันร้อง โดนหวยแ_ก อีกแล้ว",
        "แรงไม่แรง หวยทุกแผงก็ไปซื้อมาหมดแล้ว แรงพอป่ะ",
        "ถ้าเรื่องงาน โอ๊ย ไม่มีแรง ถ้าเป็นเรื่องหวย ถึงแพงก็สู้!",
        "เกิดเป็นหวยนี่ดีเนอะ อยู่เฉยๆ ก็มีคนมาทุ่มเท",
        "ไหนบอกว่าสลากกินแบ่ง ซื้อมานานไม่คิดแบ่งกันมั่งเลย",
        "จน เพราะ บน-ล่าง เป็นลูกจ้าง เพราะ ล่าง-บน",
        "แพงเกินราคาคือหวย สวยเกินมาตรฐานคือเรา",
        "ถึงเรื่องเก็งหวยจะไม่เข้าท่า แต่เรื่อง หน้าตา คิดว่าเข้าที",
        "ถูกหวยทีเหมือนเงินทอน จะให้มูฟออนได้ไง!",
        "ซื้อหวยอย่างราชา เรื่องกินเน้นมาม่าก็หรูแล้ว",
        "ไม่อยากเป็​นคนที่ถูกรัก แต่...อยากเป็​น​คนที่ถูกหวย",
        "โอกาสเป็นของคนที่เตรียมพร้อม งั้นขอซ้อมเป็นเศรษฐีแป๊บบบ #พรุ่งนี้รวย",
        "เหนื่อยกับ #wfh แค่ไหน ถ้าเป็นเรื่องหวย มีไฟ เสมอ",
        "ถึงเกลียดวิชาคณิต แต่เรื่องหวยคิดเก่งมาก",
        "ถึงทำอะไรไม่ค่อยจึ้ง แต่เรื่องเก็งรางวัลที่หนึ่งอ่ะต๊าซซซเว่อร์!",
        "ไม่อยากเก่ง ไม่อยากมีแฟน ไม่อยากสวย ฉันแค่เหนื่อยและอยากถูกหวยแค่นั้นพอ #สภาพพพ",
        "ชีวิตมีขึ้นและลง ไม่ล่างก็บนต้องถูกซักตัวล่ะน่า",
        "ตอนเช้าเป็นคนสวย เดี๋ยวตอนบ่ายจะเป็นคนสวยและรวยมาก",
        "ซื้อหวยได้ กระดาษ ซื้อสาด ได้นั่งได้นอน",
        "เรื่องหวยอ่ะงั้นๆ แต่เรื่องมั่นรับประกันว่าได้โล่ห์",
        "คนซื้อหวยไม่ใช่คนติดพนัน แต่เป็นคนมีความฝัน....ว่าสักวันฉันต้องรวย",
        "เป็นผู้หญิงอย่าหยุดหวย เพราะจะสวย ต้องรวยก่อน",
        "เรื่อง หวย กับ ผู้ชาย เลิกงมงายกันได้หรือยัง ?",
        "ไม่อยากเป็นแล้วคนถูกรัก อยากพักแล้วถูกหวยรางวัลที่ 1",
        "ถ้าดวงไม่ซวย เราจะถูกหวยไปด้วยกัน",
        "ที่ซื้อทุกงวดไม่ใช่บ้าหวย แค่อยากจะช่วยกระตุ้นเศรษฐกิจ",
        "ไม่หวังอะไรมากมาย แค่สองตัวท้ายก็เกินพอ",
        "ก่อนหวยออกคือคนเหงา พอถูกหวย เอ้า! กลายเป็นคนญาติเยอะ",
        "ถึงกีฬาไม่เอาไหน แต่ที่ไม่แพ้ใครคือเลขวิ่ง!แคปชั่นวันหวยออก สายถูกหวยกิน 2566",
        "โดนหวยกินหมดตัว ไม่น่ากลัวเท่าเธอหมดใจ",
        "ซื้อหวยแบบสู้ชีวิต แต่ชีวิตดันสู้กลับ!",
        "ถ้าถูกหวยเท่ากับความสวยที่มี คงเป็นเศรษฐีไปแล้ว!",
        "ที่เจ็บเพราะเรามันคนอ่อนไหว มองเลขไหนก็แทงไปหมด ",
        "ดวงถูกหวยได้ห้า คะแนนมั่นหน้าเกินร้อย!",
        "โดนหวยกินทั้งบนล่าง อยากโดนเธอกินบ้างบนล่างได้หมด",
        "บางครั้งเจ้ากรรมนายเวรก็มาในรูปแบบของ หวยแ_ก",
        "ที่ไม่ถูกหวย ก็แค่กลัวตัวเองจะรวยเกินไป",
        "ท้อแท้ทุกงวด หวยจะกินกันยันลูกบวชเลยเหรอไง",
        "ปกติไม่ชอบสู้ใคร แต่เรื่องหวยยอมไม่ได้ สู้เค้าดิหญิง!",
        "เราเหมือนมาม่านะรู้ไหม จะอยู่ข้างเธอตลอดไปทุกงวดเลย",
        "ถึงจะลุ้นเรื่องหวยเรื่องหุ้น แต่เรื่องรักคุณไม่ต้องลุ้น ชัวร์แน่นอน",
        "หวยกินเบื่อจัง อยากกินเธอมั่งได้มั้ยอ่ะ",
        "ไม่ถูกหวยอย่าเสียใจ มาถูกใจเราได้นะ",
        "ถึงไม่เจอเลขที่เข้าตา แต่โปรดรู้ว่ายังมีเราที่เข้าใจ",
        "ซื้อหวยโดนกินตังค์ แอดไลน์เรายังฟินกว่าเยอะ",
        "ซื้อหวยแล้วมันฟินฟิ้นฟิน หวยกินเท่านั้นที่ทำให้เงินเราโบยบิน",
        "ถึงแจ็คพ็อตยังไม่แตก แต่เรามีรักแจกให้เธอเสมอ",
        "โดนหวยกินไม่เคยพัก เรื่องรักก็ไม่เคยแผ่ว",
        "หวยกินแล้วเพลียใจ แต่เห็นเธอทีไรก็มีแรง",
        "ทีแฟนใหม่ยังมีได้ งวดต่อไปเราก็ต้องมูฟออน",
        "ที่เห็นหน้านิ่งไม่ได้หยิ่ง แต่เพิ่งโดนหวยกินหัวใจมันเจ็บ",
        "ติดโควิดกลัวกินปอด แต่ทีหวยกินตลอดอ่ะไม่เคยกลัว",
        "ตอนเช้ากินอย่างราชา พอหวยออกมา มาม่าก็หรูแล้ว",
        "ไม่ถูกหวยยังพอว่า แต่ถ้ามาม่าขึ้นราคาคือเรื่องใหญ่",
        "วันนี้มีเท่าไหร่ใส่ให้สุด แล้วไปหยุดที่ มาม่า",
        "คนไม่มีความฝันคือคนตาย...งวดหน้าเจอกันใหม่นะรางวัลที่หนึ่ง",
        "ขออภัยค่ะ หมายเลขที่ท่านเล่นไม่สามารถออกได้ในงวดนี้ กรุณาเล่นใหม่อีกครั้ง",
        "กี่ครั้งแล้วที่พ่ายแพ้ แต่ไม่เคยท้อแท้กับเรื่องหวย #ชีวิตยังมีงวดหน้าเสมอ",
        "ถ้าทนหวยกินได้ทุกที ชีวิตนี้ก็ไม่มีอะไรยาก ",
        "เจ็บแล้วจำคือคน เจ็บแล้วทนคือคนบ้าหวย"
    ]
